#!/bin/bash
#set -vx
#========================================================================================
# スクリプト名：TLS-ParmitPass.sh
# 概 要 　　　：秘密鍵を使用したopensslコマンドにて、パスワードの暗号及び復号を行う。また
#　　　 　　　：秘密鍵の作成も行う
# -hオプション：usage
# -gオプション：実行したユーザーホームディレクトリ以下の.sshに秘密鍵を作成する
# -eオプション：ファイルの暗号化を実施する
# -dオプション：ファイルの復号化を実施する
# 第二引数　　：-gオプション：秘密鍵の名前(未入力の場合はデフォルトのid-rsaになる)
#　　　　　　 ：-eオプション：暗号化するパスワードファイル
# 　　　　　　：-dオプション：復号化するファイル
# 第三引数　　：-eオプション：使用する公開鍵のパス
# 備考　　　　：暗号化する際は、暗号化後の文字列を出力するのでファイルにリダイレクトして
#  　　　　　 ：記録してください
#========================================================================================

#========================================================================================
# 変数/定数等
#========================================================================================

#========================================================================================
# 各オプションの処理記述項目
#========================================================================================

function key_generate() {
   # 秘密鍵の名前を格納
   sec_key_name=$(echo $2)
   
   # 既に同名の秘密鍵ファイルが存在していないかチェック
   ls ~/.ssh/"$sec_key_name" >& /dev/null

   # 上記の存在確認
   if [ $? -eq 0 ] ; then

	   echo '指定された秘密鍵名は既に~/.ssh/に存在するようです。別名を指定してください。'
	   exit 1

	fi

   echo '秘密鍵'"$sec_key_name"'を作成します'
   # 秘密鍵を作成
   ssh-keygen -t rsa -f ~/.ssh/"$sec_key_name"

   if [ $? -eq 0 ] ; then

      echo '秘密鍵の作成が完了しました。秘密鍵は以下のパスに存在します'
      find `pwd`/.ssh -maxdepth 1 -mindepth 1  | grep "$sec_key_name"
   
   else

	   echo '秘密鍵の作成処理が失敗しています。'
       exit 1

   fi   

}

function file_encryption() {
   # 暗号化するパスワードファイルのパスを格納
   encryption_file=$(echo $2)

   # 指定された公開鍵のパスを格納
   publickey_file=$(echo $3)
   
   # 公開鍵を利用したファイルの暗号化処理
   openssl rsautl -pubin -inkey "$publicley_file" -in "$encryption_file" -encrypt -out ./encriptionfile.txt

   # 暗号化処理が成功しているかの確認処理
   if [ $? -eq 0 ] ; then
	   
	   echo '指定したファイルをencriptionfile.txtという名前でカレントディレクトリに作成しました。'

	else

		echo 'ファイル暗号化処理が失敗しています'
		exit 1

	fi

}

#========================================================================================
# 事前処理
#========================================================================================

#========================================================================================
# 本処理
#========================================================================================

#========================================================================================
# 事後処理
#========================================================================================

